#+TITLE: Setup

#+begin_src python :results output
import sys
print(8)
#+end_src

#+RESULTS:
#+begin_example
8
#+end_example

#+BEGIN_SRC julia :results output
println(VERSION)
println("Hello")
#+END_SRC

#+RESULTS:
#+begin_example
1.5.3
Hello
#+end_example

#+begin_src emacs-lisp
(let ((default-directory "/tmp/"))
  (with-temp-buffer
    (process-file "jupyter" nil t nil "kernelspec" "list")
    (buffer-string)))
#+end_src

#+RESULTS:
#+begin_example
Available kernels:
  julia-1.0    /home/vijay/.local/share/jupyter/kernels/julia-1.0
  julia-1.5    /home/vijay/.local/share/jupyter/kernels/julia-1.5
  python3      /usr/share/jupyter/kernels/python3
#+end_example

#+NAME: mat
| 1 | 2 |

#+BEGIN_SRC jupyter-python :session p1 :var data=mat
print(9)
print("Hello")
print(data)
#+END_SRC

#+RESULTS:
#+begin_example
9
Hello
[[1, 2]]
#+end_example

#+BEGIN_SRC jupyter-julia :session j1 :var data=mat
using DelimitedFiles
println(VERSION)
println("Hello")
name="whoami";
#+END_SRC

#+RESULTS:
:RESULTS:
# [goto error]
#+begin_example
UndefVarError: readcsv not defined

Stacktrace:
 [1] top-level scope at In[5]:1
 [2] include_string(::Function, ::Module, ::String, ::String) at ./loading.jl:1091
#+end_example
:END:


#+BEGIN_SRC jupyter-julia :session j1
println(2)
println("Hello ",name)
#+END_SRC

#+RESULTS:
#+begin_example
2
Hello whoami
#+end_example

** Julia sandbox

#+BEGIN_SRC jupyter-julia :session j2 :results output
mat = [1 2;  2 3 ];
vec1 = [1;2];
vec2 = mat*vec1;
print(vec2)
#+END_SRC

#+RESULTS:
#+begin_example
[5, 8]
#+end_example
